[Killed] StringLiteral
ScholarshipEligibilityEvaluator.js:3:23
 class Status {
     static APPROVED = "APPROVED";
-    static REJECTED = "REJECTED";
+    static REJECTED = "";
     static MANUAL_REVIEW = "MANUAL_REVIEW";
 }
killedBy: ScholarshipEligibilityEvaluator Decisions and combined flows Status contém os valores estáticos corretos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REJECTED"
Received: ""

[Killed] StringLiteral
ScholarshipEligibilityEvaluator.js:4:28
 class Status {
     static APPROVED = "APPROVED";
     static REJECTED = "REJECTED";
-    static MANUAL_REVIEW = "MANUAL_REVIEW";
+    static MANUAL_REVIEW = "";
 }
 
killedBy: ScholarshipEligibilityEvaluator Decisions and combined flows Status contém os valores estáticos corretos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MANUAL_REVIEW"
Received: ""

[Killed] BlockStatement
ScholarshipEligibilityEvaluator.js:8:34
 }
 
 class EvaluationResult {
-    constructor(status, reasons) {
-        this.status = status;
-        this.reasons = reasons;
-    }
+    constructor(status, reasons) {}
 }
 
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: undefined

[Killed] BlockStatement
ScholarshipEligibilityEvaluator.js:27:19
     const reviewReasons = [];
 
     // Rule 1 - Age
-    if (age < 16) {
-        rejectionReasons.push("Applicant is younger than the minimum age.");
-    } else if (age <= 17) {
+    if (age < 16) {} else if (age <= 17) {
         reviewReasons.push("Applicant is under 18 and requires manual review.");
     }
killedBy: ScholarshipEligibilityEvaluator REJECTED cases deve rejeitar por idade menor que 16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REJECTED"
Received: "APPROVED"

[Killed] EqualityOperator
ScholarshipEligibilityEvaluator.js:27:9
     const reviewReasons = [];
 
     // Rule 1 - Age
-    if (age < 16) {
+    if (age >= 16) {
         rejectionReasons.push("Applicant is younger than the minimum age.");
     } else if (age <= 17) {
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "REJECTED"

[Killed] StringLiteral
ScholarshipEligibilityEvaluator.js:28:31
 
     // Rule 1 - Age
     if (age < 16) {
-        rejectionReasons.push("Applicant is younger than the minimum age.");
+        rejectionReasons.push("");
     } else if (age <= 17) {
         reviewReasons.push("Applicant is under 18 and requires manual review.");
killedBy: ScholarshipEligibilityEvaluator REJECTED cases deve rejeitar por idade menor que 16
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Applicant is younger than the minimum age."
Received array: [""]

[Killed] EqualityOperator
ScholarshipEligibilityEvaluator.js:29:16
     // Rule 1 - Age
     if (age < 16) {
         rejectionReasons.push("Applicant is younger than the minimum age.");
-    } else if (age <= 17) {
+    } else if (age > 17) {
         reviewReasons.push("Applicant is under 18 and requires manual review.");
     }
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] EqualityOperator
ScholarshipEligibilityEvaluator.js:29:16
     // Rule 1 - Age
     if (age < 16) {
         rejectionReasons.push("Applicant is younger than the minimum age.");
-    } else if (age <= 17) {
+    } else if (age < 17) {
         reviewReasons.push("Applicant is under 18 and requires manual review.");
     }
killedBy: ScholarshipEligibilityEvaluator MANUAL_REVIEW cases deve encaminhar para revisão manual por idade entre 16 e 17
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MANUAL_REVIEW"
Received: "APPROVED"

[Killed] BlockStatement
ScholarshipEligibilityEvaluator.js:34:20
     }
 
     // Rule 2 - GPA
-    if (gpa < 6.0) {
-        rejectionReasons.push("GPA is below the minimum required.");
-    } else if (gpa < 7.0) {
+    if (gpa < 6.0) {} else if (gpa < 7.0) {
         reviewReasons.push("GPA is in the manual review range.");
     }
killedBy: ScholarshipEligibilityEvaluator REJECTED cases deve rejeitar por GPA abaixo de 6.0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REJECTED"
Received: "APPROVED"

[Killed] EqualityOperator
ScholarshipEligibilityEvaluator.js:34:9
     }
 
     // Rule 2 - GPA
-    if (gpa < 6.0) {
+    if (gpa <= 6.0) {
         rejectionReasons.push("GPA is below the minimum required.");
     } else if (gpa < 7.0) {
killedBy: ScholarshipEligibilityEvaluator Boundary values gpa = 6.0 → MANUAL_REVIEW (limite inferior da faixa de revisão)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MANUAL_REVIEW"
Received: "REJECTED"

[Killed] StringLiteral
ScholarshipEligibilityEvaluator.js:35:31
 
     // Rule 2 - GPA
     if (gpa < 6.0) {
-        rejectionReasons.push("GPA is below the minimum required.");
+        rejectionReasons.push("");
     } else if (gpa < 7.0) {
         reviewReasons.push("GPA is in the manual review range.");
killedBy: ScholarshipEligibilityEvaluator REJECTED cases deve rejeitar por GPA abaixo de 6.0
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "GPA is below the minimum required."
Received array: [""]

[Killed] BlockStatement
ScholarshipEligibilityEvaluator.js:36:27
     // Rule 2 - GPA
     if (gpa < 6.0) {
         rejectionReasons.push("GPA is below the minimum required.");
-    } else if (gpa < 7.0) {
-        reviewReasons.push("GPA is in the manual review range.");
-    }
+    } else if (gpa < 7.0) {}
 
     // Rule 3 - Attendance
killedBy: ScholarshipEligibilityEvaluator MANUAL_REVIEW cases deve encaminhar para revisão manual por GPA entre 6.0 e 6.9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MANUAL_REVIEW"
Received: "APPROVED"

[Killed] EqualityOperator
ScholarshipEligibilityEvaluator.js:36:16
     // Rule 2 - GPA
     if (gpa < 6.0) {
         rejectionReasons.push("GPA is below the minimum required.");
-    } else if (gpa < 7.0) {
+    } else if (gpa >= 7.0) {
         reviewReasons.push("GPA is in the manual review range.");
     }
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] ConditionalExpression
ScholarshipEligibilityEvaluator.js:41:9
     }
 
     // Rule 3 - Attendance
-    if (attendanceRate < 75.0) {
+    if (true) {
         rejectionReasons.push("Attendance rate is below the minimum required.");
     } else if (attendanceRate < 80.0) {
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "REJECTED"

[Killed] ConditionalExpression
ScholarshipEligibilityEvaluator.js:41:9
     }
 
     // Rule 3 - Attendance
-    if (attendanceRate < 75.0) {
+    if (false) {
         rejectionReasons.push("Attendance rate is below the minimum required.");
     } else if (attendanceRate < 80.0) {
killedBy: ScholarshipEligibilityEvaluator REJECTED cases deve rejeitar por frequência abaixo de 75%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REJECTED"
Received: "MANUAL_REVIEW"

[Killed] EqualityOperator
ScholarshipEligibilityEvaluator.js:43:16
     // Rule 3 - Attendance
     if (attendanceRate < 75.0) {
         rejectionReasons.push("Attendance rate is below the minimum required.");
-    } else if (attendanceRate < 80.0) {
+    } else if (attendanceRate <= 80.0) {
         reviewReasons.push("Attendance rate is in the manual review range.");
     }
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar com valores mínimos exatos para aprovação (age=18, gpa=7.0, attendance=80.0)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] ConditionalExpression
ScholarshipEligibilityEvaluator.js:43:16
     // Rule 3 - Attendance
     if (attendanceRate < 75.0) {
         rejectionReasons.push("Attendance rate is below the minimum required.");
-    } else if (attendanceRate < 80.0) {
+    } else if (false) {
         reviewReasons.push("Attendance rate is in the manual review range.");
     }
killedBy: ScholarshipEligibilityEvaluator MANUAL_REVIEW cases deve encaminhar para revisão manual por frequência entre 75% e 79.9%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MANUAL_REVIEW"
Received: "APPROVED"

[Killed] StringLiteral
ScholarshipEligibilityEvaluator.js:44:28
     if (attendanceRate < 75.0) {
         rejectionReasons.push("Attendance rate is below the minimum required.");
     } else if (attendanceRate < 80.0) {
-        reviewReasons.push("Attendance rate is in the manual review range.");
+        reviewReasons.push("");
     }
 
killedBy: ScholarshipEligibilityEvaluator MANUAL_REVIEW cases deve encaminhar para revisão manual por frequência entre 75% e 79.9%
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "Attendance rate is in the manual review range."
Received array: [""]

[Killed] ConditionalExpression
ScholarshipEligibilityEvaluator.js:48:9
     }
 
     // Rule 4 - Required courses
-    if (!hasRequiredCourses) {
+    if (true) {
         rejectionReasons.push("Required courses have not been completed.");
     }
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "REJECTED"

[Killed] BooleanLiteral
ScholarshipEligibilityEvaluator.js:48:9
     }
 
     // Rule 4 - Required courses
-    if (!hasRequiredCourses) {
+    if (hasRequiredCourses) {
         rejectionReasons.push("Required courses have not been completed.");
     }
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "REJECTED"

[Killed] ConditionalExpression
ScholarshipEligibilityEvaluator.js:53:9
     }
 
     // Rule 5 - Disciplinary record
-    if (disciplinaryRecord) {
+    if (false) {
         rejectionReasons.push("Applicant has a disciplinary record.");
     }
killedBy: ScholarshipEligibilityEvaluator REJECTED cases deve rejeitar por registro disciplinar
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REJECTED"
Received: "APPROVED"

[Killed] ConditionalExpression
ScholarshipEligibilityEvaluator.js:53:9
     }
 
     // Rule 5 - Disciplinary record
-    if (disciplinaryRecord) {
+    if (true) {
         rejectionReasons.push("Applicant has a disciplinary record.");
     }
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "REJECTED"

[Killed] ConditionalExpression
ScholarshipEligibilityEvaluator.js:58:9
     }
 
     // Final decision
-    if (rejectionReasons.length > 0) {
+    if (false) {
         return new EvaluationResult(Status.REJECTED, rejectionReasons);
     }
killedBy: ScholarshipEligibilityEvaluator REJECTED cases deve rejeitar por idade menor que 16
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "REJECTED"
Received: "APPROVED"

[Killed] EqualityOperator
ScholarshipEligibilityEvaluator.js:58:9
     }
 
     // Final decision
-    if (rejectionReasons.length > 0) {
+    if (rejectionReasons.length <= 0) {
         return new EvaluationResult(Status.REJECTED, rejectionReasons);
     }
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "REJECTED"

[Killed] EqualityOperator
ScholarshipEligibilityEvaluator.js:62:9
         return new EvaluationResult(Status.REJECTED, rejectionReasons);
     }
 
-    if (reviewReasons.length > 0) {
+    if (reviewReasons.length >= 0) {
         return new EvaluationResult(Status.MANUAL_REVIEW, reviewReasons);
     }
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] ConditionalExpression
ScholarshipEligibilityEvaluator.js:62:9
         return new EvaluationResult(Status.REJECTED, rejectionReasons);
     }
 
-    if (reviewReasons.length > 0) {
+    if (true) {
         return new EvaluationResult(Status.MANUAL_REVIEW, reviewReasons);
     }
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "APPROVED"
Received: "MANUAL_REVIEW"

[Killed] ArrayDeclaration
ScholarshipEligibilityEvaluator.js:68:9
 
     return new EvaluationResult(
         Status.APPROVED,
-        ["Applicant meets all scholarship requirements."]
+        []
     );
 }
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Array [
-   "Applicant meets all scholarship requirements.",
- ]

[Killed] BlockStatement
ScholarshipEligibilityEvaluator.js:72:46
     );
 }
 
-function validateInputs(gpa, attendanceRate) {
-    if (gpa < 0.0 || gpa > 10.0) {
-        throw new Error("GPA must be between 0 and 10.");
-    }
-
-    if (attendanceRate < 0.0 || attendanceRate > 100.0) {
-        throw new Error("Attendance rate must be between 0 and 100.");
-    }
-}
+function validateInputs(gpa, attendanceRate) {}
 
 
killedBy: ScholarshipEligibilityEvaluator Invalid inputs (validation) deve lançar erro para GPA negativo
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "GPA must be between 0 and 10."

Received function did not throw

[Killed] ConditionalExpression
ScholarshipEligibilityEvaluator.js:73:9
 }
 
 function validateInputs(gpa, attendanceRate) {
-    if (gpa < 0.0 || gpa > 10.0) {
+    if (true) {
         throw new Error("GPA must be between 0 and 10.");
     }
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: Error: GPA must be between 0 and 10.

[Killed] EqualityOperator
ScholarshipEligibilityEvaluator.js:73:9
 }
 
 function validateInputs(gpa, attendanceRate) {
-    if (gpa < 0.0 || gpa > 10.0) {
+    if (gpa <= 0.0 || gpa > 10.0) {
         throw new Error("GPA must be between 0 and 10.");
     }
killedBy: ScholarshipEligibilityEvaluator Boundary values gpa = 0.0 → válido (não lança erro), resulta em REJECTED
statusReason: Error: GPA must be between 0 and 10.

[Killed] ConditionalExpression
ScholarshipEligibilityEvaluator.js:77:9
         throw new Error("GPA must be between 0 and 10.");
     }
 
-    if (attendanceRate < 0.0 || attendanceRate > 100.0) {
+    if (false) {
         throw new Error("Attendance rate must be between 0 and 100.");
     }
killedBy: ScholarshipEligibilityEvaluator Invalid inputs (validation) deve lançar erro para frequência negativa
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Attendance rate must be between 0 and 100."

Received function did not throw

[Killed] ConditionalExpression
ScholarshipEligibilityEvaluator.js:77:9
         throw new Error("GPA must be between 0 and 10.");
     }
 
-    if (attendanceRate < 0.0 || attendanceRate > 100.0) {
+    if (false || attendanceRate > 100.0) {
         throw new Error("Attendance rate must be between 0 and 100.");
     }
killedBy: ScholarshipEligibilityEvaluator Invalid inputs (validation) deve lançar erro para frequência negativa
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Attendance rate must be between 0 and 100."

Received function did not throw

[Killed] StringLiteral
ScholarshipEligibilityEvaluator.js:78:25
     }
 
     if (attendanceRate < 0.0 || attendanceRate > 100.0) {
-        throw new Error("Attendance rate must be between 0 and 100.");
+        throw new Error("");
     }
 }
killedBy: ScholarshipEligibilityEvaluator Invalid inputs (validation) deve lançar erro para frequência negativa
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Attendance rate must be between 0 and 100."
Received message:   ""

      180 |       } else {
      181 |         stryCov_9fa48("85");
    > 182 |         throw new Error(stryMutAct_9fa48("86") ? "" : (stryCov_9fa48("86"), "Attendance rate must be between 0 and 100."));

[Survived] ConditionalExpression
ScholarshipEligibilityEvaluator.js:84:5
 
 
 // Example usage
-if (require.main === module) {
+if (true) {
     const result = evaluateScholarship(
         18,

[NoCoverage] BlockStatement
ScholarshipEligibilityEvaluator.js:84:30
 
 
 // Example usage
-if (require.main === module) {
-    const result = evaluateScholarship(
-        18,
-        8.5,
-        92.0,
-        true,
-        false
-    );
-
-    console.log(result);
-}
+if (require.main === module) {}
 
 

[NoCoverage] BooleanLiteral
ScholarshipEligibilityEvaluator.js:89:9
         18,
         8.5,
         92.0,
-        true,
+        false,
         false
     );

[NoCoverage] BooleanLiteral
ScholarshipEligibilityEvaluator.js:90:9
         8.5,
         92.0,
         true,
-        false
+        true
     );
 

[Killed] ObjectLiteral
ScholarshipEligibilityEvaluator.js:98:18
 
 
 // Export for testing
-module.exports = {
-    evaluateScholarship,
-    Status,
-    EvaluationResult
-};
+module.exports = {};
killedBy: ScholarshipEligibilityEvaluator APPROVED cases deve aprovar candidato ideal (todos os critérios ótimos)
statusReason: TypeError: evaluateScholarship is not a function
